# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list1 = [2, 3, 4, 5, 6]
print(list1)

def fun(list):
    a = 0
    b = int(len(list)-1)
    res = []
    while a<=b:
        res.append(int(list[a]*list[b]))
        a+=1
        b-=1
    return res

print(fun(list1))

